HELYXcore-4.4.0/examples/legacy/incompressible/pimpleDyMFoam/wingMotion/wingMotion2D_simpleFoam/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/

flowVelocity         (100 0 0);
pressure             0;
turbulentKE          37;
turbulentOmega       32;

// ************************************************************************* //
